src/cf/Documents/ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДанныеПланированияПродажПлитка</xr:Item>
				<xr:Item>InformationRegister.КомментарииКПланированиюПродажПлитка</xr:Item>
				<xr:Item>InformationRegister.ДанныеПланированияПродажПлиткаКвартал</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВерсииСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогНаселенныеПункты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТТ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПотенциальнойТорговойТочки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеПланированияПродажПлиткаКвартал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПланированияПродажПлиткаКвартал</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КорректировкаКоличествоВОФактУПП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланВыставленияСледующийКвартал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РотацияПанелей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоШоуРум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьШоуРум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПланСледующийКвартал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентУценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МерчендайзингАкция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МерчендайзингIndoor</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МерчендайзингOutdoor</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПотенциальнойТорговойТочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотенциальнойТорговойТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогНаселенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомплектПанелей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомплектыПанелейДляПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогБренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВерсииСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КомментарииКПланированиюПродажПлитка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>КомментарииКПланированиюПродажПлитка</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогНаселенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогРынки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогБренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомплектПанелей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомплектыПанелейДляПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПотенциальнойТТ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотенциальнойТорговойТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Выставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогВерсииСценариевПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/вогСценарииПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>вогСценарииПланирования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПериодыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Строка из ДанныеПланирования цикл
		Если Строка.УИД="" тогда
			Строка.УИД = Новый УникальныйИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Плитка) КАК Направление,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка.Автор КАК Автор,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Город КАК Город,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.ВидТТ КАК ВидТТ,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.УИД КАК ТорговаяТочка,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка.СценарийПланирования КАК Сценарий,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка.ВерсияСценария КАК Версия,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка.ПериодПланирования КАК ПериодПланирования,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Комментарий КАК Комментарий,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка.Дата КАК Период,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.ВидТТ КАК ВидПотенциальнойТорговойТочки,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Клиент КАК Клиент
	|ИЗ
	|	Документ.ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка.ДанныеПланирования КАК ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка КАК ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка
	|		ПО ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Ссылка = ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка.Ссылка
	|ГДЕ
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	// ++ VOG Солодов В.В. 05.03.2021 DEV-218
	Если СценарийПланирования = Справочники.вогСценарииПланирования.ПланНаКвартал Тогда
		
		ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
		ТаблицаДвижений.Колонки.Добавить("СценарийПланирования");
		ТаблицаДвижений.Колонки.Добавить("Подразделение");
		
		УстановитьПривилегированныйРежим(Истина);
		ОбособленноеПодразделение = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(Автор.Подразделение);
		
		Для Каждого СтрокаДвижений Из ТаблицаДвижений Цикл
			СтрокаДвижений.Подразделение 		= ОбособленноеПодразделение;
			СтрокаДвижений.СценарийПланирования = СтрокаДвижений.Сценарий;
		КонецЦикла;
		
		Движения.ДанныеПланированияПродажПлиткаКвартал.Загрузить(ТаблицаДвижений);
		Движения.ДанныеПланированияПродажПлиткаКвартал.Записывать = Истина;
		
	Иначе // -- VOG Солодов В.В. 05.03.2021 DEV-218
		Движения.ДанныеПланированияПродажПлитка.Загрузить(Запрос.Выполнить().Выгрузить());
		Движения.ДанныеПланированияПродажПлитка.Записывать = Истина;
		УстановитьПривилегированныйРежим(Истина);
		Для каждого Запись из Движения.ДанныеПланированияПродажПлитка цикл
			
			Запись.Подразделение = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(Запись.Автор.Подразделение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// ++ VOG Солодов В.В. 18.03.2021 DEV-218
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Плитка) КАК НаправлениеДеятельности,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Ссылка.СценарийПланирования КАК СценарийПланирования,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Город КАК Регион,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.УИД КАК ТорговаяТочка,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.ВидТТ КАК ВидПотенциальнойТТ,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Комментарий КАК Комментарий,
	// +++ VOG Кулаков П.Л. 09.06.2021 DEV-605
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Ссылка.ВерсияСценария КАК ВерсияСценария,
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Ссылка.ПериодПланирования КАК ПериодПланирования
	// --- VOG Кулаков П.Л.
	|ИЗ
	|	Документ.ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка.ДанныеПланирования КАК ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования
	|ГДЕ
	|	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Ссылка = &Ссылка";
	// До изменения
	//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//               |	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Город КАК Регион,
	//               |	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.УИД КАК ТорговаяТочка,
	//               |	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Комментарий КАК Комментарий,
	//               |	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Ссылка.Дата КАК Период
	//               |ИЗ
	//               |	Документ.ПланированиеПродажПоПотенциальнымТорговымТочкамПлитка.ДанныеПланирования КАК ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования
	//               |ГДЕ
	//               |	ПланированиеПродажПоПотенциальнымТорговымТочкамПлиткаДанныеПланирования.Ссылка = &Ссылка";
	// -- VOG Солодов В.В. 18.03.2021 DEV-218
	
	Движения.КомментарииКПланированиюПродажПлитка.Загрузить(Запрос.Выполнить().Выгрузить());
	// +++ VOG Кулаков П.Л. 09.06.2021 DEV-605
	Для каждого Запись из Движения.КомментарииКПланированиюПродажПлитка цикл
			Запись.Подразделение = Справочники.СтруктураПредприятия.ПолучитьОбособленноеПодразделение(Автор.Подразделение);
	КонецЦикла;
	// --- VOG Кулаков П.Л.
	Движения.КомментарииКПланированиюПродажПлитка.Записывать = Истина;
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Для каждого Строка из ДанныеПланирования цикл
		Строка.УИД = "";	
	КонецЦикла;
	
КонецПроцедуры
